(***********************************************************************
 * Видеокурс: Язык программирования Паскаль для начинающих.            *
 * Тип данных String, процедуры и функции, работающие со строками.     *
 * Урок 6                                                              *
 * Автор: Смирнов Владимир                                             *
 ***********************************************************************)
 
program TypeString;
var
  s1, s2, s3, s4: String;
  i: Integer;
 
BEGIN
  s1 := 'Ваня';
  s2 := 'Вов';

  if  s1 >= s2 then
    writeln( s1, ' больше или равно ', s2 )
  else
    writeln( s2, ' больше или равно ', s1 );
END.