(************************************************************
 * Видеокурс: Язык программирования Паскаль для начинающих. *
 * Константы, массивы и цикл FOR.                           *
 * Урок 7                                                   *
 * Автор: Смирнов Владимир                                  *
 ************************************************************)
 
program ConstantsArraysFor;
const
  N = 5;
 
var
  mas: array[1..N] of Integer;
  i: Integer;
 
BEGIN
  writeln( 'Вам необходимо внести ', N, ' целых чисел.' );
  for i := 1 to N do begin
    write( i, ': ' );
    readln( mas[i] );
  end;
  
  writeln( mas );
  readln;
END.